const {TwoPagesOnSheet} = require('./toPrintBook.js');

var assert = require('assert');
describe('PagesBook', function() {
  describe('toPrintBook 2 pages on sheet', function() {
    it('Example 81 pages', function() {
      assert.deepStrictEqual(TwoPagesOnSheet(81, 5), [
        ['20,1,18,3,16,5,14,7,12,9', '10,11,8,13,6,15,4,17,2,19'],
        ['40,21,38,23,36,25,34,27,32,29', '30,31,28,33,26,35,24,37,22,39'],
        ['60,41,58,43,56,45,54,47,52,49', '50,51,48,53,46,55,44,57,42,59'],
        ['80,61,78,63,76,65,74,67,72,69', '70,71,68,73,66,75,64,77,62,79'],
        ['Пустая страница,81', 'Пустая страница,Пустая страница'],
      ]);
    });

    it('Example 82 pages', function() {
      assert.deepStrictEqual(TwoPagesOnSheet(82, 5), [
        ['20,1,18,3,16,5,14,7,12,9', '10,11,8,13,6,15,4,17,2,19'],
        ['40,21,38,23,36,25,34,27,32,29', '30,31,28,33,26,35,24,37,22,39'],
        ['60,41,58,43,56,45,54,47,52,49', '50,51,48,53,46,55,44,57,42,59'],
        ['80,61,78,63,76,65,74,67,72,69', '70,71,68,73,66,75,64,77,62,79'],
        ['Пустая страница,81', '82,Пустая страница'],
      ]);
    });

    it('Example 83 pages', function() {
      assert.deepStrictEqual(TwoPagesOnSheet(83, 5), [
        ['20,1,18,3,16,5,14,7,12,9', '10,11,8,13,6,15,4,17,2,19'],
        ['40,21,38,23,36,25,34,27,32,29', '30,31,28,33,26,35,24,37,22,39'],
        ['60,41,58,43,56,45,54,47,52,49', '50,51,48,53,46,55,44,57,42,59'],
        ['80,61,78,63,76,65,74,67,72,69', '70,71,68,73,66,75,64,77,62,79'],
        ['Пустая страница,81', '82,83'],
      ]);
    });

    it('Example 84 pages', function() {
      assert.deepStrictEqual(TwoPagesOnSheet(84, 5), [
        ['20,1,18,3,16,5,14,7,12,9', '10,11,8,13,6,15,4,17,2,19'],
        ['40,21,38,23,36,25,34,27,32,29', '30,31,28,33,26,35,24,37,22,39'],
        ['60,41,58,43,56,45,54,47,52,49', '50,51,48,53,46,55,44,57,42,59'],
        ['80,61,78,63,76,65,74,67,72,69', '70,71,68,73,66,75,64,77,62,79'],
        ['84,81', '82,83'],
      ]);
    });
  });

  describe('toPrintBook 2 pages on sheet with empty page', function() {
    it('Example 80 pages', function() {
      assert.deepStrictEqual(TwoPagesOnSheet(80, 5, true), [
        ['18,Пустая страница,16,1,14,3,12,5,10,7', '8,9,6,11,4,13,2,15,Пустая страница,17'],
        ['38,19,36,21,34,23,32,25,30,27', '28,29,26,31,24,33,22,35,20,37'],
        ['58,39,56,41,54,43,52,45,50,47', '48,49,46,51,44,53,42,55,40,57'],
        ['78,59,76,61,74,63,72,65,70,67', '68,69,66,71,64,73,62,75,60,77'],
        ['Пустая страница,79', '80,Пустая страница'],
      ]);
    });

    it('Example 81 pages', function() {
      assert.deepStrictEqual(TwoPagesOnSheet(81, 5, true), [
        ['18,Пустая страница,16,1,14,3,12,5,10,7', '8,9,6,11,4,13,2,15,Пустая страница,17'],
        ['38,19,36,21,34,23,32,25,30,27', '28,29,26,31,24,33,22,35,20,37'],
        ['58,39,56,41,54,43,52,45,50,47', '48,49,46,51,44,53,42,55,40,57'],
        ['78,59,76,61,74,63,72,65,70,67', '68,69,66,71,64,73,62,75,60,77'],
        ['Пустая страница,79,Пустая страница,81', '80,Пустая страница'],
        // ['Пустая страница,79,Пустая страница,81', '80,Пустая страница,Пустая страница,Пустая страница'],
      ]);
    });

    it('Example 82 pages', function() {
      assert.deepStrictEqual(TwoPagesOnSheet(82, 5, true), [
        ['18,Пустая страница,16,1,14,3,12,5,10,7', '8,9,6,11,4,13,2,15,Пустая страница,17'],
        ['38,19,36,21,34,23,32,25,30,27', '28,29,26,31,24,33,22,35,20,37'],
        ['58,39,56,41,54,43,52,45,50,47', '48,49,46,51,44,53,42,55,40,57'],
        ['78,59,76,61,74,63,72,65,70,67', '68,69,66,71,64,73,62,75,60,77'],
        ['Пустая страница,79,82,81', '80,Пустая страница'],
      ]);
    });

    it('Example 83 pages', function() {
      assert.deepStrictEqual(TwoPagesOnSheet(83, 5, true), [
        ['18,Пустая страница,16,1,14,3,12,5,10,7', '8,9,6,11,4,13,2,15,Пустая страница,17'],
        ['38,19,36,21,34,23,32,25,30,27', '28,29,26,31,24,33,22,35,20,37'],
        ['58,39,56,41,54,43,52,45,50,47', '48,49,46,51,44,53,42,55,40,57'],
        ['78,59,76,61,74,63,72,65,70,67', '68,69,66,71,64,73,62,75,60,77'],
        ['Пустая страница,79,Пустая страница,81', '82,83,80,Пустая страница'],
      ]);
    });
  });
});